Revit 2027 API
PipingSystemType.FluidType Property
 Fluid Type
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId FluidType { get; set; }
Public Property FluidType As ElementId
	Get
	Set
public:
property ElementId^ FluidType {
	ElementId^ get ();
	void set (ElementId^ value);
}
member FluidType : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: fluidTypeId is not a fluid type.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
PipingSystemType Class
Autodesk.Revit.DB.Plumbing Namespace